---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
source: html/60cc6328-1e99-2a7b-03fb-983e52350e55.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled

Defines parameters for hot rolled structural sections.

## Syntax (C#)
```csharp
public class StructuralSectionHotRolled : StructuralSectionRectangular
```